ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L4xx/stm32l4s5xx.h
#define DAC_MCR_MODE2_Pos           (16U)
#define DAC_MCR_MODE2_Msk           (0x7UL << DAC_MCR_MODE2_Pos)               /*!< 0x00070000 */
#define DAC_MCR_MODE2               DAC_MCR_MODE2_Msk                          /*!<MODE2[2:0] (DAC channel2 mode) */
#define DAC_MCR_MODE2_0             (0x1UL << DAC_MCR_MODE2_Pos)               /*!< 0x00010000 */
#define DAC_MCR_MODE2_1             (0x2UL << DAC_MCR_MODE2_Pos)               /*!< 0x00020000 */
#define DAC_MCR_MODE2_2             (0x4UL << DAC_MCR_MODE2_Pos)               /*!< 0x00040000 */

/******************  Bit definition for DAC_SHSR1 register  ******************/
#define DAC_SHSR1_TSAMPLE1_Pos      (0U)
#define DAC_SHSR1_TSAMPLE1_Msk      (0x3FFUL << DAC_SHSR1_TSAMPLE1_Pos)        /*!< 0x000003FF */
#define DAC_SHSR1_TSAMPLE1          DAC_SHSR1_TSAMPLE1_Msk                     /*!<DAC channel1 sample time */

/******************  Bit definition for DAC_SHSR2 register  ******************/
#define DAC_SHSR2_TSAMPLE2_Pos      (0U)
#define DAC_SHSR2_TSAMPLE2_Msk      (0x3FFUL << DAC_SHSR2_TSAMPLE2_Pos)        /*!< 0x000003FF */
#define DAC_SHSR2_TSAMPLE2          DAC_SHSR2_TSAMPLE2_Msk                     /*!<DAC channel2 sample time */

/******************  Bit definition for DAC_SHHR register  ******************/
#define DAC_SHHR_THOLD1_Pos         (0U)
#define DAC_SHHR_THOLD1_Msk         (0x3FFUL << DAC_SHHR_THOLD1_Pos)           /*!< 0x000003FF */
#define DAC_SHHR_THOLD1             DAC_SHHR_THOLD1_Msk                        /*!<DAC channel1 hold time */
#define DAC_SHHR_THOLD2_Pos         (16U)
#define DAC_SHHR_THOLD2_Msk         (0x3FFUL << DAC_SHHR_THOLD2_Pos)           /*!< 0x03FF0000 */
#define DAC_SHHR_THOLD2             DAC_SHHR_THOLD2_Msk                        /*!<DAC channel2 hold time */

/******************  Bit definition for DAC_SHRR register  ******************/
#define DAC_SHRR_TREFRESH1_Pos      (0U)
#define DAC_SHRR_TREFRESH1_Msk      (0xFFUL << DAC_SHRR_TREFRESH1_Pos)         /*!< 0x000000FF */
#define DAC_SHRR_TREFRESH1          DAC_SHRR_TREFRESH1_Msk                     /*!<DAC channel1 refresh time */
#define DAC_SHRR_TREFRESH2_Pos      (16U)
#define DAC_SHRR_TREFRESH2_Msk      (0xFFUL << DAC_SHRR_TREFRESH2_Pos)         /*!< 0x00FF0000 */
#define DAC_SHRR_TREFRESH2          DAC_SHRR_TREFRESH2_Msk                     /*!<DAC channel2 refresh time */

/******************************************************************************/
/*                                                                            */
/*                                    DCMI                                    */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DCMI_CR register  ******************/
#define DCMI_CR_CAPTURE_Pos           (0U)
#define DCMI_CR_CAPTURE_Msk           (0x1UL << DCMI_CR_CAPTURE_Pos)           /*!< 0x00000001 */
#define DCMI_CR_CAPTURE               DCMI_CR_CAPTURE_Msk                      /*!< DCMI Capture enable */
#define DCMI_CR_CM_Pos                (1U)
#define DCMI_CR_CM_Msk                (0x1UL << DCMI_CR_CM_Pos)                /*!< 0x00000002 */
#define DCMI_CR_CM                    DCMI_CR_CM_Msk                           /*!< DCMI Capture mode */
#define DCMI_CR_CROP_Pos              (2U)
#define DCMI_CR_CROP_Msk              (0x1UL << DCMI_CR_CROP_Pos)              /*!< 0x00000004 */
#define DCMI_CR_CROP                  DCMI_CR_CROP_Msk                         /*!< DCMI Crop feature */
#define DCMI_CR_JPEG_Pos              (3U)
#define DCMI_CR_JPEG_Msk              (0x1UL << DCMI_CR_JPEG_Pos)              /*!< 0x00000008 */
#define DCMI_CR_JPEG                  DCMI_CR_JPEG_Msk                         /*!< DCMI JPEG format */
#define DCMI_CR_ESS_Pos               (4U)
#define DCMI_CR_ESS_Msk               (0x1UL << DCMI_CR_ESS_Pos)               /*!< 0x00000010 */
#define DCMI_CR_ESS                   DCMI_CR_ESS_Msk                          /*!< DCMI Embedded synchronization select */
#define DCMI_CR_PCKPOL_Pos            (5U)
#define DCMI_CR_PCKPOL_Msk            (0x1UL << DCMI_CR_PCKPOL_Pos)            /*!< 0x00000020 */
#define DCMI_CR_PCKPOL                DCMI_CR_PCKPOL_Msk                       /*!< DCMI Pixel clock polarity */
#define DCMI_CR_HSPOL_Pos             (6U)
#define DCMI_CR_HSPOL_Msk             (0x1UL << DCMI_CR_HSPOL_Pos)             /*!< 0x00000040 */
#define DCMI_CR_HSPOL                 DCMI_CR_HSPOL_Msk                        /*!< DCMI Horizontal synchronization polarity */
#define DCMI_CR_VSPOL_Pos             (7U)
#define DCMI_CR_VSPOL_Msk             (0x1UL << DCMI_CR_VSPOL_Pos)             /*!< 0x00000080 */
#define DCMI_CR_VSPOL                 DCMI_CR_VSPOL_Msk                        /*!< DCMI Vertical synchronization polarity */
#define DCMI_CR_FCRC_Pos              (8U)
#define DCMI_CR_FCRC_Msk              (0x3UL << DCMI_CR_FCRC_Pos)              /*!< 0x00000300 */
#define DCMI_CR_FCRC                  DCMI_CR_FCRC_Msk                         /*!< DCMI Frame capture rate control FCRC[1:0] */
#define DCMI_CR_FCRC_0                (0x1UL << DCMI_CR_FCRC_Pos)              /*!< 0x00000100 */
#define DCMI_CR_FCRC_1                (0x2UL << DCMI_CR_FCRC_Pos)              /*!< 0x00000200 */
#define DCMI_CR_EDM_Pos               (10U)
#define DCMI_CR_EDM_Msk               (0x3UL << DCMI_CR_EDM_Pos)               /*!< 0x00000C00 */
#define DCMI_CR_EDM                   DCMI_CR_EDM_Msk                          /*!< DCMI Extended data mode EDM[1:0] */
#define DCMI_CR_EDM_0                 (0x1UL << DCMI_CR_EDM_Pos)               /*!< 0x00000400 */
#define DCMI_CR_EDM_1                 (0x2UL << DCMI_CR_EDM_Pos)               /*!< 0x00000800 */
#define DCMI_CR_ENABLE_Pos            (14U)
#define DCMI_CR_ENABLE_Msk            (0x1UL << DCMI_CR_ENABLE_Pos)            /*!< 0x00004000 */
#define DCMI_CR_ENABLE                DCMI_CR_ENABLE_Msk                       /*!< DCMI DCMI enable */
#define DCMI_CR_BSM_Pos               (16U)
#define DCMI_CR_BSM_Msk               (0x3UL << DCMI_CR_BSM_Pos)               /*!< 0x00030000 */
#define DCMI_CR_BSM                   DCMI_CR_BSM_Msk                          /*!< DCMI Byte Select mode BSM[1:0] */
#define DCMI_CR_BSM_0                 (0x1UL << DCMI_CR_BSM_Pos)               /*!< 0x00010000 */
#define DCMI_CR_BSM_1                 (0x2UL << DCMI_CR_BSM_Pos)               /*!< 0x00020000 */
#define DCMI_CR_OEBS_Pos              (18U)
#define DCMI_CR_OEBS_Msk              (0x1UL << DCMI_CR_OEBS_Pos)              /*!< 0x00040000 */
#define DCMI_CR_OEBS                  DCMI_CR_OEBS_Msk                         /*!< DCMI Odd/Even Byte Select (Byte Select Start) */
#define DCMI_CR_LSM_Pos               (19U)
#define DCMI_CR_LSM_Msk               (0x1UL << DCMI_CR_LSM_Pos)               /*!< 0x00080000 */
#define DCMI_CR_LSM                   DCMI_CR_LSM_Msk                          /*!< DCMI Line Select mode */
#define DCMI_CR_OELS_Pos              (20U)
#define DCMI_CR_OELS_Msk              (0x1UL << DCMI_CR_OELS_Pos)              /*!< 0x00100000 */
#define DCMI_CR_OELS                  DCMI_CR_OELS_Msk                         /*!< DCMI Odd/Even Line Select (Line Select Start) */

/********************  Bits definition for DCMI_SR register  ******************/
#define DCMI_SR_HSYNC_Pos             (0U)
#define DCMI_SR_HSYNC_Msk             (0x1UL << DCMI_SR_HSYNC_Pos)             /*!< 0x00000001 */
#define DCMI_SR_HSYNC                 DCMI_SR_HSYNC_Msk
#define DCMI_SR_VSYNC_Pos             (1U)
#define DCMI_SR_VSYNC_Msk             (0x1UL << DCMI_SR_VSYNC_Pos)             /*!< 0x00000002 */
#define DCMI_SR_VSYNC                 DCMI_SR_VSYNC_Msk
#define DCMI_SR_FNE_Pos               (2U)
#define DCMI_SR_FNE_Msk               (0x1UL << DCMI_SR_FNE_Pos)               /*!< 0x00000004 */
#define DCMI_SR_FNE                   DCMI_SR_FNE_Msk                          /*!< DCMI FIFO not empty */

